rtkconnectivity/zephyr/drivers/i2s/i2s_rtl87x2g.c
	switch (strm->state) {
	case I2S_STATE_RUNNING:
	case I2S_STATE_STOPPING:
		ret = k_msgq_get(&strm->in_queue, &buffer, K_NO_WAIT);
		if (ret) {
			if (strm->state == I2S_STATE_STOPPING) {
				/* TX queue has drained */
				strm->state = I2S_STATE_READY;
				goto disabled_exit_drop;
				LOG_DBG("TX stream has stopped");
			} else {
				strm->state = I2S_STATE_ERROR;
				goto disabled_exit_no_drop;
				LOG_DBG("TX stream no data");
			}
		}

		if (strm->ping_pong_index == 0) {
			memcpy(strm->ping_pong_buf[0], buffer, strm->cfg.block_size);
			strm->ping_pong_index = 1;
		} else {
			memcpy(strm->ping_pong_buf[1], buffer, strm->cfg.block_size);
			strm->ping_pong_index = 0;
		}

		ret = k_msgq_put(&strm->out_queue, &buffer, K_NO_WAIT);
		goto enabled_exit;

	case I2S_STATE_ERROR:
	default:
		goto disabled_exit_drop;
	}

disabled_exit_no_drop:
	i2s_tx_stream_disable(dev, false);
	return;

disabled_exit_drop:
	i2s_tx_stream_disable(dev, true);
	return;

enabled_exit:
	return;
}

static int i2s_tx_stream_start(const struct device *dev)
{
	const struct i2s_rtl87x2g_config *dev_cfg = dev->config;
	struct i2s_rtl87x2g_data *dev_data = dev->data;
	I2S_TypeDef *base = (I2S_TypeDef *)dev_cfg->base;
	int ret = 0;
	void *buffer[2];
	struct stream *strm = &dev_data->dma_tx;
	const struct device *dma_dev = strm->dma_dev;
	struct dma_block_config *blk_cfg = strm->blk_cfg;

	if (blk_cfg[0].block_size != strm->cfg.block_size) {
		if (strm->ping_pong_buf[0] != NULL) {
			k_free(strm->ping_pong_buf[0]);
			k_free(strm->ping_pong_buf[1]);
		}

		strm->ping_pong_buf[0] = k_malloc(strm->cfg.block_size);
		if (strm->ping_pong_buf[0] == NULL) {
			return -EIO;
		}

		strm->ping_pong_buf[1] = k_malloc(strm->cfg.block_size);
		if (strm->ping_pong_buf[1] == NULL) {
			k_free(strm->ping_pong_buf[0]);
			return -EIO;
		}
	}

	/* retrieve buffer from input queue */
	ret = k_msgq_get(&strm->in_queue, &buffer[0], K_NO_WAIT);
	if (ret != 0) {
		LOG_ERR("No buffer in input queue to start");
		return -EIO;
	}

	memcpy(strm->ping_pong_buf[0], buffer[0], strm->cfg.block_size);

	/* Configure the DMA with the first TX block */
	blk_cfg[0].source_address = (uint32_t)strm->ping_pong_buf[0];
	blk_cfg[0].block_size = strm->cfg.block_size;
	blk_cfg[1].source_address = (uint32_t)strm->ping_pong_buf[1];
	blk_cfg[1].block_size = strm->cfg.block_size;

	LOG_DBG("tx stream start");
	ret = dma_config(dma_dev, strm->dma_channel, &strm->dma_cfg);
	if (ret) {
		LOG_ERR("Failed to config DMA Ch%d (%d)", strm->dma_channel, ret);
	}

	/* put buffer in output queue */
	ret = k_msgq_put(&strm->out_queue, &buffer[0], K_NO_WAIT);
	if (ret != 0) {
		LOG_ERR("failed to put buffer in output queue");
		return ret;
	}

	strm->ping_pong_index = 0;

	I2S_Cmd(base, I2S_MODE_TX, ENABLE);

	ret = dma_start(dma_dev, strm->dma_channel);
	if (ret < 0) {
		LOG_ERR("dma_start failed (%d)", ret);
		return ret;
	}

	return 0;
}

static int i2s_rtl87x2g_write(const struct device *dev, void *mem_block, size_t size)
{
	struct i2s_rtl87x2g_data *dev_data = dev->data;
	struct stream *strm = &dev_data->dma_tx;
	int ret;

	LOG_DBG("i2s_rtl87x2g_write");
	if (strm->state != I2S_STATE_RUNNING && strm->state != I2S_STATE_READY) {
		LOG_ERR("invalid state (%d)", strm->state);
		return -EIO;
	}

	ret = k_msgq_put(&strm->in_queue, &mem_block, SYS_TIMEOUT_MS(strm->cfg.timeout));
	if (ret) {
		LOG_DBG("k_msgq_put returned code %d", ret);
		return ret;
	}

	return ret;
}
#endif

#if defined(CONFIG_I2S_RTL87X2G_RX)
static void i2s_rx_stream_disable(const struct device *dev, bool in_drop, bool out_drop)
{
	const struct i2s_rtl87x2g_config *dev_cfg = dev->config;
	struct i2s_rtl87x2g_data *dev_data = dev->data;
	I2S_TypeDef *base = (I2S_TypeDef *)dev_cfg->base;
	struct stream *strm = &dev_data->dma_rx;
	const struct device *dma_dev = strm->dma_dev;

	LOG_DBG("Stopping RX stream & DMA channel %u", strm->dma_channel);

	I2S_Cmd(base, I2S_MODE_RX, DISABLE);

	dma_stop(dma_dev, strm->dma_channel);

	/* purge buffers queued in the stream */
	if (in_drop || out_drop) {
		i2s_purge_stream_buffers(strm, dev_data->dma_rx.cfg.mem_slab, in_drop, out_drop);
	}
}

static int i2s_rx_stream_start(const struct device *dev)
{
	const struct i2s_rtl87x2g_config *dev_cfg = dev->config;
	struct i2s_rtl87x2g_data *dev_data = dev->data;
	I2S_TypeDef *base = (I2S_TypeDef *)dev_cfg->base;
	int ret = 0;
	void *buffer[2];
	struct stream *strm = &dev_data->dma_rx;
	const struct device *dma_dev = strm->dma_dev;
	uint8_t num_of_bufs;
	struct dma_block_config *blk_cfg = strm->blk_cfg;

	if (blk_cfg[0].block_size != strm->cfg.block_size) {
		if (strm->ping_pong_buf[0] != NULL) {
			k_free(strm->ping_pong_buf[0]);
			k_free(strm->ping_pong_buf[1]);
		}
		strm->ping_pong_buf[0] = k_malloc(strm->cfg.block_size);
		if (strm->ping_pong_buf[0] == NULL) {
			LOG_ERR("[%s] buf malloc fail! line%d\n", __func__, __LINE__);
			return -EIO;
		}
		strm->ping_pong_buf[1] = k_malloc(strm->cfg.block_size);
		if (strm->ping_pong_buf[1] == NULL) {
			k_free(strm->ping_pong_buf[0]);
			LOG_ERR("[%s] buf malloc fail! line%d\n", __func__, __LINE__);
			return -EIO;
		}
	}

	num_of_bufs = k_mem_slab_num_free_get(strm->cfg.mem_slab);

	/*
	 * Need at least 2 buffers on the RX memory slab
	 * for reliable DMA reception.
	 */
	if (num_of_bufs < 2) {
		return -EINVAL;
	}

	/* allocate 1st receive buffer from SLAB */
	ret = k_mem_slab_alloc(strm->cfg.mem_slab, &buffer[0], K_NO_WAIT);
	if (ret) {
		LOG_DBG("buffer alloc from mem_slab failed (%d)", ret);
		return ret;
	}

	/* Configure DMA block */
	blk_cfg[0].dest_address = (uint32_t)strm->ping_pong_buf[0];
	blk_cfg[0].block_size = strm->cfg.block_size;
	blk_cfg[1].dest_address = (uint32_t)strm->ping_pong_buf[1];
	blk_cfg[1].block_size = strm->cfg.block_size;

	ret = dma_config(dma_dev, strm->dma_channel, &strm->dma_cfg);
	if (ret) {
		LOG_ERR("Failed to config DMA Ch%d (%d)", strm->dma_channel, ret);
	}

	/* put buffer in input queue */
	ret = k_msgq_put(&strm->in_queue, &buffer[0], K_NO_WAIT);
	if (ret) {
		LOG_ERR("failed to put buffer in input queue, ret1 %d", ret);
		return ret;
	}

	LOG_DBG("Starting DMA Ch%u", strm->dma_channel);
	strm->ping_pong_index = 0;
	I2S_Cmd(base, I2S_MODE_RX, ENABLE);
	ret = dma_start(dma_dev, strm->dma_channel);

	if (ret) {
		LOG_ERR("Failed to start DMA Ch%d (%d)", strm->dma_channel, ret);
		return ret;
	}

