rtkconnectivity/zephyr/drivers/i2s/i2s_rtl87x2g.c
	return 0;
}

static int i2s_rtl87x2g_read(const struct device *dev, void **mem_block, size_t *size)
{
	struct i2s_rtl87x2g_data *dev_data = dev->data;
	struct stream *strm = &dev_data->dma_rx;
	void *buffer;
	int status, ret = 0;

	if (strm->state == I2S_STATE_NOT_READY) {
		LOG_ERR("invalid state %d", strm->state);
		return -EIO;
	}

	status = k_msgq_get(&strm->out_queue, &buffer, SYS_TIMEOUT_MS(strm->cfg.timeout));
	if (status != 0) {
		if (strm->state == I2S_STATE_ERROR) {
			ret = -EIO;
		} else {
			LOG_DBG("need retry");
			ret = -EAGAIN;
		}
		return ret;
	}

	*mem_block = buffer;
	*size = strm->cfg.block_size;
	return 0;
}

static void i2s_rtl87x2g_dma_rx_cb(const struct device *dma_dev, void *arg, uint32_t channel,
				   int status)
{
	struct device *dev = (struct device *)arg;
	struct i2s_rtl87x2g_data *dev_data = dev->data;
	struct stream *strm = &dev_data->dma_rx;
	void *buffer;
	int ret;

	LOG_DBG("RX cb");

	switch (strm->state) {
	case I2S_STATE_RUNNING:
	case I2S_STATE_STOPPING:
		/* retrieve buffer from input queue */
		ret = k_msgq_get(&strm->in_queue, &buffer, K_NO_WAIT);
		__ASSERT_NO_MSG(ret == 0);

		if (strm->ping_pong_index == 0) {
			memcpy(buffer, strm->ping_pong_buf[0], strm->cfg.block_size);
			strm->ping_pong_index = 1;
		} else {
			memcpy(buffer, strm->ping_pong_buf[1], strm->cfg.block_size);
			strm->ping_pong_index = 0;
		}

		/* put buffer to output queue */
		ret = k_msgq_put(&strm->out_queue, &buffer, K_NO_WAIT);

		if (ret != 0) {
			LOG_ERR("buffer %p -> out_queue %p err %d", buffer, &strm->out_queue, ret);
			i2s_rx_stream_disable(dev, false, false);
			strm->state = I2S_STATE_ERROR;
			return;
		}
		if (strm->state == I2S_STATE_RUNNING) {
			/* allocate new buffer for next audio frame */
			ret = k_mem_slab_alloc(strm->cfg.mem_slab, &buffer, K_NO_WAIT);
			if (ret != 0) {
				LOG_ERR("buffer alloc from slab %p err %d", strm->cfg.mem_slab,
					ret);
				i2s_rx_stream_disable(dev, false, false);
				strm->state = I2S_STATE_ERROR;
			} else {
				/* put buffer in input queue */
				ret = k_msgq_put(&strm->in_queue, &buffer, K_NO_WAIT);
				if (ret != 0) {
					LOG_ERR("%p -> in_queue %p err %d", buffer, &strm->in_queue,
						ret);
				}
			}
		} else {
			i2s_rx_stream_disable(dev, true, false);
			/* Received a STOP/DRAIN trigger */
			strm->state = I2S_STATE_READY;
		}
		break;
	case I2S_STATE_ERROR:
		i2s_rx_stream_disable(dev, true, true);
		break;
	}
}
#endif

static int i2s_rtl87x2g_configure(const struct device *dev, enum i2s_dir dir,
				  const struct i2s_config *i2s_cfg)
{
	const struct i2s_rtl87x2g_config *dev_cfg = dev->config;
	struct i2s_rtl87x2g_data *dev_data = dev->data;
	I2S_TypeDef *base = (I2S_TypeDef *)dev_cfg->base;
	uint32_t *blck_mi, *blck_ni;
#if defined(CONFIG_SOC_SERIES_RTL87X2G)
	I2SChannelType_TypeDef *channel_type;
	I2SDataFormat_TypeDef *data_format;
	I2SDataWidth_TypeDef *data_width;
#endif

	I2S_InitTypeDef I2S_InitStruct;

	if (dir == I2S_DIR_TX) {
#if defined(CONFIG_I2S_RTL87X2G_TX)
		if ((dev_data->dma_tx.state != I2S_STATE_NOT_READY) &&
		    (dev_data->dma_tx.state != I2S_STATE_READY)) {
			LOG_ERR("invalid state tx(%u)", dev_data->dma_tx.state);
			return -EINVAL;
		}
		dev_data->dma_tx.state = I2S_STATE_NOT_READY;
#else
		return -EINVAL;
#endif
	} else if (dir == I2S_DIR_RX) {
#if defined(CONFIG_I2S_RTL87X2G_RX)
		if ((dev_data->dma_rx.state != I2S_STATE_NOT_READY) &&
		    (dev_data->dma_rx.state != I2S_STATE_READY)) {
			LOG_ERR("invalid state rx(%u)", dev_data->dma_rx.state);
			return -EINVAL;
		}
		dev_data->dma_rx.state = I2S_STATE_NOT_READY;
#else
		return -EINVAL;
#endif
	}

#if defined(CONFIG_SOC_SERIES_RTL87X2G)
	blck_mi = &I2S_InitStruct.I2S_TxBClockMi;
	blck_ni = &I2S_InitStruct.I2S_TxBClockNi;
	channel_type = &I2S_InitStruct.I2S_TxChannelType;
	data_format = &I2S_InitStruct.I2S_TxDataFormat;
	data_width = &I2S_InitStruct.I2S_TxDataWidth;
	I2S_InitStruct.I2S_TxBClockDiv = 63;
	I2S_InitStruct.I2S_RxBClockDiv = 63;
	I2S_InitStruct.I2S_TxChannelWidth = I2S_Width_32Bits;
	I2S_InitStruct.I2S_RxChannelWidth = I2S_Width_32Bits;
	I2S_InitStruct.I2S_TxFifoUsed = I2S_FIFO_USE_0_REG_0;
	I2S_InitStruct.I2S_RxFifoUsed = I2S_FIFO_USE_0_REG_0;
#endif

	if (i2s_cfg->frame_clk_freq == 0) {
		(void)clock_control_off(RTL87X2G_CLOCK_CONTROLLER,
					(clock_control_subsys_t)&dev_cfg->clkid);

		i2s_set_satus(dev_data, dir, I2S_STATE_NOT_READY);
	} else if ((i2s_cfg->frame_clk_freq % 25U) == 0U &&
		   (i2s_cfg->frame_clk_freq / 25U) <= 0x7FFFU) {
		/*
		 * BCLK = I2S_SRC_CLK * (Ni / Mi), with a 64 * fs frame (32-bit
		 * channel width, stereo). Fixing Mi at 25000 gives Ni = fs / 25,
		 * which is exact for every standard audio rate (8k - 192k) and
		 * fits the 15-bit Ni field (max 192000 / 25 = 7680). This
		 * reproduces the legacy 8k/16k/48k ratios.
		 */
		*blck_mi = 25000U;
		*blck_ni = i2s_cfg->frame_clk_freq / 25U;
	} else {
		LOG_ERR("invalid i2s sample rate: %d", i2s_cfg->frame_clk_freq);
		i2s_set_satus(dev_data, dir, I2S_STATE_NOT_READY);
		return -EINVAL;
	}

	if (i2s_cfg->word_size == 8) {
		*data_width = I2S_Width_8Bits;
	} else if (i2s_cfg->word_size == 16) {
		*data_width = I2S_Width_16Bits;
	} else if (i2s_cfg->word_size == 24) {
		*data_width = I2S_Width_24Bits;
#if defined(CONFIG_SOC_SERIES_RTL87X2G)
	} else if (i2s_cfg->word_size == 20) {
		*data_width = I2S_Width_20Bits;
	} else if (i2s_cfg->word_size == 32) {
		*data_width = I2S_Width_32Bits;
#endif
	} else {
		LOG_ERR("invalid i2s word size: %d", i2s_cfg->word_size);
		i2s_set_satus(dev_data, dir, I2S_STATE_NOT_READY);
		return -EINVAL;
	}

	/* channels == 0 for i2s codec tx pdm */
	if (i2s_cfg->channels == 1 || i2s_cfg->channels == 0) {
		*channel_type = I2S_Channel_Mono;
	} else if (i2s_cfg->channels == 2) {
		*channel_type = I2S_Channel_stereo;
	} else {
		LOG_ERR("invalid i2s channels: %d", i2s_cfg->channels);
		i2s_set_satus(dev_data, dir, I2S_STATE_NOT_READY);
		return -EINVAL;
	}

	if ((i2s_cfg->format & I2S_FMT_DATA_FORMAT_MASK) == I2S_FMT_DATA_FORMAT_I2S) {
		*data_format = I2S_Mode;
	} else if ((i2s_cfg->format & I2S_FMT_DATA_FORMAT_MASK) == I2S_FMT_DATA_FORMAT_PCM_SHORT) {
		*data_format = PCM_Mode_A;
	} else if ((i2s_cfg->format & I2S_FMT_DATA_FORMAT_MASK) == I2S_FMT_DATA_FORMAT_PCM_LONG) {
		*data_format = PCM_Mode_B;
	} else if ((i2s_cfg->format & I2S_FMT_DATA_FORMAT_MASK) ==
		   I2S_FMT_DATA_FORMAT_LEFT_JUSTIFIED) {
		*data_format = Left_Justified_Mode;
	} else {
		LOG_ERR("invalid i2s format: 0x%x", i2s_cfg->format);
		i2s_set_satus(dev_data, dir, I2S_STATE_NOT_READY);
		return -EINVAL;
	}

	if ((i2s_cfg->format & I2S_FMT_DATA_ORDER_LSB) == I2S_FMT_DATA_ORDER_LSB) {
		I2S_InitStruct.I2S_TxBitSequence = RTL87X2G_I2S_TX_LSB_First;
		I2S_InitStruct.I2S_RxBitSequence = RTL87X2G_I2S_RX_LSB_First;
	} else {
		I2S_InitStruct.I2S_TxBitSequence = RTL87X2G_I2S_TX_MSB_First;
		I2S_InitStruct.I2S_RxBitSequence = RTL87X2G_I2S_RX_MSB_First;
	}

	if ((i2s_cfg->options & I2S_OPT_BIT_CLK_SLAVE) == I2S_OPT_BIT_CLK_SLAVE) {
		I2S_InitStruct.I2S_DeviceMode = I2S_DeviceMode_Slave;
	} else {
		I2S_InitStruct.I2S_DeviceMode = I2S_DeviceMode_Master;
	}

	if ((i2s_cfg->options & I2S_OPT_BIT_CLK_GATED) == I2S_OPT_BIT_CLK_GATED) {
		return -EINVAL;
	}

