rtkconnectivity/zephyr/drivers/i2s/i2s_rtl87x2g.c
	/* register ISR */
	dev_cfg->irq_config_func(dev);

	LOG_INF("Device %s initialized", dev->name);

	return 0;
}

static const struct i2s_driver_api i2s_rtl87x2g_driver_api = {
	.configure = i2s_rtl87x2g_configure,
#if defined(CONFIG_I2S_RTL87X2G_RX)
	.read = i2s_rtl87x2g_read,
#endif
#if defined(CONFIG_I2S_RTL87X2G_TX)
	.write = i2s_rtl87x2g_write,
#endif
	.config_get = i2s_rtl87x2g_config_get,
	.trigger = i2s_rtl87x2g_trigger,
};

#define I2S_DMA_CHANNEL_INIT(index, dir)                                                           \
	.dma_dev = DEVICE_DT_GET(RTL87X2G_DMA_CTLR(index, dir)),                                   \
	.dma_channel = DT_INST_DMAS_CELL_BY_NAME(index, dir, channel),                             \
	.dma_cfg =                                                                                 \
		{                                                                                  \
			.dma_slot = DT_INST_DMAS_CELL_BY_NAME(index, dir, slot),                   \
			.channel_direction = RTL87X2G_DMA_CONFIG_DIRECTION(                        \
				RTL87X2G_DMA_CHANNEL_CONFIG(index, dir)),                          \
			.channel_priority = RTL87X2G_DMA_CONFIG_PRIORITY(                          \
				RTL87X2G_DMA_CHANNEL_CONFIG(index, dir)),                          \
			.source_data_size = RTL87X2G_DMA_CONFIG_SOURCE_DATA_SIZE(                  \
				RTL87X2G_DMA_CHANNEL_CONFIG(index, dir)),                          \
			.dest_data_size = RTL87X2G_DMA_CONFIG_DESTINATION_DATA_SIZE(               \
				RTL87X2G_DMA_CHANNEL_CONFIG(index, dir)),                          \
			.source_burst_length = RTL87X2G_DMA_CONFIG_SOURCE_MSIZE(                   \
				RTL87X2G_DMA_CHANNEL_CONFIG(index, dir)),                          \
			.dest_burst_length = RTL87X2G_DMA_CONFIG_DESTINATION_MSIZE(                \
				RTL87X2G_DMA_CHANNEL_CONFIG(index, dir)),                          \
			.block_count = 2,                                                          \
			.complete_callback_en = true,                                              \
			.dma_callback = i2s_rtl87x2g_dma_##dir##_cb,                               \
			.cyclic = true,                                                            \
	},                                                                                         \
	.src_addr_increment =                                                                      \
		RTL87X2G_DMA_CONFIG_SOURCE_ADDR_INC(RTL87X2G_DMA_CHANNEL_CONFIG(index, dir)),      \
	.dst_addr_increment =                                                                      \
		RTL87X2G_DMA_CONFIG_DESTINATION_ADDR_INC(RTL87X2G_DMA_CHANNEL_CONFIG(index, dir)),

#define I2S_DMA_CHANNEL(index, dir)                                                                \
	.dma_##dir = {COND_CODE_1(DT_INST_DMAS_HAS_NAME(index, dir),                               \
				  (I2S_DMA_CHANNEL_INIT(index, dir)), (NULL))},

#if defined(CONFIG_I2S_RTL87X2G_TX) && defined(CONFIG_I2S_RTL87X2G_RX)
#define I2S_DMA_INIT(index) I2S_DMA_CHANNEL(index, tx) I2S_DMA_CHANNEL(index, rx)
#elif defined(CONFIG_I2S_RTL87X2G_TX)
#define I2S_DMA_INIT(index) I2S_DMA_CHANNEL(index, tx)
#elif defined(CONFIG_I2S_RTL87X2G_RX)
#define I2S_DMA_INIT(index) I2S_DMA_CHANNEL(index, rx)
#endif

#define RTL87X2G_I2S_INIT(index)                                                                   \
	static void i2s_rtl87x2g_irq_config_func_##index(const struct device *dev);                \
                                                                                                   \
	PINCTRL_DT_INST_DEFINE(index);                                                             \
                                                                                                   \
	static const struct i2s_rtl87x2g_config i2s_rtl87x2g_cfg_##index = {                       \
		.base = (I2S_TypeDef *)DT_INST_REG_ADDR(index),                                    \
		.clkid = DT_INST_CLOCKS_CELL(index, id),                                           \
		.irq_config_func = i2s_rtl87x2g_irq_config_func_##index,                           \
		.pinctrl = PINCTRL_DT_INST_DEV_CONFIG_GET(index),                                  \
		.internal_codec = DT_NODE_HAS_COMPAT_STATUS(DT_INST_CHILD(index, codec_0),         \
							    realtek_rtl87x2g_codec, okay),         \
	};                                                                                         \
                                                                                                   \
	static struct i2s_rtl87x2g_data i2s_rtl87x2g_data_##index = {I2S_DMA_INIT(index)};         \
                                                                                                   \
	DEVICE_DT_INST_DEFINE(index, &i2s_rtl87x2g_init, NULL, &i2s_rtl87x2g_data_##index,         \
			      &i2s_rtl87x2g_cfg_##index, POST_KERNEL, CONFIG_I2S_INIT_PRIORITY,    \
			      &i2s_rtl87x2g_driver_api);                                           \
                                                                                                   \
	static void i2s_rtl87x2g_irq_config_func_##index(const struct device *dev)                 \
	{                                                                                          \
		IRQ_CONNECT(DT_INST_IRQ_BY_IDX(index, 0, irq),                                     \
			    DT_INST_IRQ_BY_IDX(index, 0, priority), i2s_rtl87x2g_isr,              \
			    DEVICE_DT_INST_GET(index), 0);                                         \
		irq_enable(DT_INST_IRQN(index));                                                   \
	}

DT_INST_FOREACH_STATUS_OKAY(RTL87X2G_I2S_INIT)
